Goodjamp/HIDVideoStream/sdk/devices/LPC54608/mcuxpresso/startup_LPC54608.c
/* File: startup_ARMCM4.c
 * Purpose: startup file for Cortex-M4 devices.
 *          Should be used with GCC 'GNU Tools ARM Embedded'
 * Version: V1.01
 * Date: 12 June 2014
 *
 */
/* Copyright (c) 2011 - 2014 ARM LIMITED

   All rights reserved.
   Redistribution and use in source and binary forms, with or without
   modification, are permitted provided that the following conditions are met:
   - Redistributions of source code must retain the above copyright
     notice, this list of conditions and the following disclaimer.
   - Redistributions in binary form must reproduce the above copyright
     notice, this list of conditions and the following disclaimer in the
     documentation and/or other materials provided with the distribution.
   - Neither the name of ARM nor the names of its contributors may be used
     to endorse or promote products derived from this software without
     specific prior written permission.
   *
   THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
   AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
   IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
   ARE DISCLAIMED. IN NO EVENT SHALL COPYRIGHT HOLDERS AND CONTRIBUTORS BE
   LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
   CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
   SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
   INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
   CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
   ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
   POSSIBILITY OF SUCH DAMAGE.
   ---------------------------------------------------------------------------*/

#include <stdint.h>
#include "fsl_device_registers.h"

/*----------------------------------------------------------------------------
  Linker generated Symbols
 *----------------------------------------------------------------------------*/
extern uint32_t __etext;
extern uint32_t __data_start__;
extern uint32_t __data_end__;
extern uint32_t __copy_table_start__;
extern uint32_t __copy_table_end__;
extern uint32_t __zero_table_start__;
extern uint32_t __zero_table_end__;
extern uint32_t __bss_start__;
extern uint32_t __bss_end__;
extern uint32_t __StackTop;

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler Function Prototype
 *----------------------------------------------------------------------------*/
typedef void( *pFunc )( void );


/*----------------------------------------------------------------------------
  External References
 *----------------------------------------------------------------------------*/
#ifndef __START
extern void  _start(void) __attribute__((noreturn));    /* PreeMain (C library entry point) */
#else
extern int  __START(void) __attribute__((noreturn));    /* main entry point */
#endif

#ifndef __NO_SYSTEM_INIT
extern void SystemInit (void);            /* CMSIS System Initialization      */
#endif


/*----------------------------------------------------------------------------
  Internal References
 *----------------------------------------------------------------------------*/
void Default_Handler(void);                          /* Default empty handler */
void Reset_Handler(void);                            /* Reset Handler */


/*----------------------------------------------------------------------------
  User Initial Stack & Heap
 *----------------------------------------------------------------------------*/
#ifndef __STACK_SIZE
  #define	__STACK_SIZE  0x00000200
#endif
static uint8_t stack[__STACK_SIZE] __attribute__ ((aligned(8), used, section(".stack")));

#ifndef __HEAP_SIZE
  #define	__HEAP_SIZE   0x00000000
#endif
#if __HEAP_SIZE > 0
static uint8_t heap[__HEAP_SIZE]   __attribute__ ((aligned(8), used, section(".heap")));
#endif


/*----------------------------------------------------------------------------
  Exception / Interrupt Handler
 *----------------------------------------------------------------------------*/
/* Cortex-M4 Processor Exceptions */
void __attribute__ ((weak)) NMI_Handler                                (void) { while(1); };
void __attribute__ ((weak)) HardFault_Handler                          (void) { while(1); };
void __attribute__ ((weak)) MemManage_Handler                          (void) { while(1); };
void __attribute__ ((weak)) BusFault_Handler                           (void) { while(1); };
void __attribute__ ((weak)) UsageFault_Handler                         (void) { while(1); };
void __attribute__ ((weak)) SVC_Handler                                (void) { while(1); };
void __attribute__ ((weak)) DebugMon_Handler                           (void) { while(1); };
void __attribute__ ((weak)) PendSV_Handler                             (void) { while(1); };
void __attribute__ ((weak)) SysTick_Handler                            (void) { while(1); };

/* External interrupts */
extern void WDT_BOD_DriverIRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
extern void DMA0_DriverIRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
extern void GINT0_DriverIRQHandler              (void) __attribute__ ((weak, alias("Default_Handler")));
extern void GINT1_DriverIRQHandler              (void) __attribute__ ((weak, alias("Default_Handler")));
extern void PIN_INT0_DriverIRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
extern void PIN_INT1_DriverIRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
extern void PIN_INT2_DriverIRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
extern void PIN_INT3_DriverIRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
extern void UTICK0_DriverIRQHandler             (void) __attribute__ ((weak, alias("Default_Handler")));
extern void MRT0_DriverIRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
extern void CTIMER0_DriverIRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
extern void CTIMER1_DriverIRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
extern void SCT0_DriverIRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
extern void CTIMER3_DriverIRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
extern void FLEXCOMM0_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void FLEXCOMM1_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void FLEXCOMM2_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void FLEXCOMM3_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void FLEXCOMM4_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void FLEXCOMM5_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void FLEXCOMM6_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void FLEXCOMM7_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void ADC0_SEQA_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void ADC0_SEQB_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void ADC0_THCMP_DriverIRQHandler         (void) __attribute__ ((weak, alias("Default_Handler")));
extern void DMIC0_DriverIRQHandler              (void) __attribute__ ((weak, alias("Default_Handler")));
extern void HWVAD0_DriverIRQHandler             (void) __attribute__ ((weak, alias("Default_Handler")));
extern void USB0_NEEDCLK_DriverIRQHandler       (void) __attribute__ ((weak, alias("Default_Handler")));
extern void USB0_DriverIRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
extern void RTC_DriverIRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
extern void Reserved46_DriverIRQHandler         (void) __attribute__ ((weak, alias("Default_Handler")));
extern void Reserved47_DriverIRQHandler         (void) __attribute__ ((weak, alias("Default_Handler")));
extern void PIN_INT4_DriverIRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
extern void PIN_INT5_DriverIRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
extern void PIN_INT6_DriverIRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
extern void PIN_INT7_DriverIRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
extern void CTIMER2_DriverIRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
extern void CTIMER4_DriverIRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
extern void RIT_DriverIRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
extern void SPIFI0_DriverIRQHandler             (void) __attribute__ ((weak, alias("Default_Handler")));
extern void FLEXCOMM8_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void FLEXCOMM9_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void SDIO_DriverIRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
extern void CAN0_IRQ0_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void CAN0_IRQ1_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void CAN1_IRQ0_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void CAN1_IRQ1_DriverIRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
extern void USB1_DriverIRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
extern void USB1_NEEDCLK_DriverIRQHandler       (void) __attribute__ ((weak, alias("Default_Handler")));
extern void ETHERNET_DriverIRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
extern void ETHERNET_PMT_DriverIRQHandler       (void) __attribute__ ((weak, alias("Default_Handler")));
extern void ETHERNET_MACLP_DriverIRQHandler     (void) __attribute__ ((weak, alias("Default_Handler")));
extern void EEPROM_DriverIRQHandler             (void) __attribute__ ((weak, alias("Default_Handler")));
extern void LCD_DriverIRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
extern void SHA_DriverIRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
extern void SMARTCARD0_DriverIRQHandler         (void) __attribute__ ((weak, alias("Default_Handler")));
extern void SMARTCARD1_DriverIRQHandler         (void) __attribute__ ((weak, alias("Default_Handler")));

__attribute__ ((weak)) void WDT_BOD_IRQHandler        (void) { WDT_BOD_DriverIRQHandler();        }
__attribute__ ((weak)) void DMA0_IRQHandler           (void) { DMA0_DriverIRQHandler();           }
__attribute__ ((weak)) void GINT0_IRQHandler          (void) { GINT0_DriverIRQHandler();          }
__attribute__ ((weak)) void GINT1_IRQHandler          (void) { GINT1_DriverIRQHandler();          }
__attribute__ ((weak)) void PIN_INT0_IRQHandler       (void) { PIN_INT0_DriverIRQHandler();       }
__attribute__ ((weak)) void PIN_INT1_IRQHandler       (void) { PIN_INT1_DriverIRQHandler();       }
__attribute__ ((weak)) void PIN_INT2_IRQHandler       (void) { PIN_INT2_DriverIRQHandler();       }
__attribute__ ((weak)) void PIN_INT3_IRQHandler       (void) { PIN_INT3_DriverIRQHandler();       }
__attribute__ ((weak)) void UTICK0_IRQHandler         (void) { UTICK0_DriverIRQHandler();         }
__attribute__ ((weak)) void MRT0_IRQHandler           (void) { MRT0_DriverIRQHandler();           }
__attribute__ ((weak)) void CTIMER0_IRQHandler        (void) { CTIMER0_DriverIRQHandler();        }
__attribute__ ((weak)) void CTIMER1_IRQHandler        (void) { CTIMER1_DriverIRQHandler();        }
__attribute__ ((weak)) void SCT0_IRQHandler           (void) {
    SCT0_DriverIRQHandler();           }
__attribute__ ((weak)) void CTIMER3_IRQHandler        (void) { CTIMER3_DriverIRQHandler();        }
__attribute__ ((weak)) void FLEXCOMM0_IRQHandler      (void) { FLEXCOMM0_DriverIRQHandler();      }
__attribute__ ((weak)) void FLEXCOMM1_IRQHandler      (void) { FLEXCOMM1_DriverIRQHandler();      }
__attribute__ ((weak)) void FLEXCOMM2_IRQHandler      (void) { FLEXCOMM2_DriverIRQHandler();      }
__attribute__ ((weak)) void FLEXCOMM3_IRQHandler      (void) { FLEXCOMM3_DriverIRQHandler();      }
__attribute__ ((weak)) void FLEXCOMM4_IRQHandler      (void) { FLEXCOMM4_DriverIRQHandler();      }
__attribute__ ((weak)) void FLEXCOMM5_IRQHandler      (void) { FLEXCOMM5_DriverIRQHandler();      }
__attribute__ ((weak)) void FLEXCOMM6_IRQHandler      (void) { FLEXCOMM6_DriverIRQHandler();      }
__attribute__ ((weak)) void FLEXCOMM7_IRQHandler      (void) { FLEXCOMM7_DriverIRQHandler();      }
__attribute__ ((weak)) void ADC0_SEQA_IRQHandler      (void) { ADC0_SEQA_DriverIRQHandler();      }
__attribute__ ((weak)) void ADC0_SEQB_IRQHandler      (void) { ADC0_SEQB_DriverIRQHandler();      }
__attribute__ ((weak)) void ADC0_THCMP_IRQHandler     (void) { ADC0_THCMP_DriverIRQHandler();     }
__attribute__ ((weak)) void DMIC0_IRQHandler          (void) { DMIC0_DriverIRQHandler();          }
__attribute__ ((weak)) void HWVAD0_IRQHandler         (void) { HWVAD0_DriverIRQHandler();         }
__attribute__ ((weak)) void USB0_NEEDCLK_IRQHandler   (void) { USB0_NEEDCLK_DriverIRQHandler();   }
__attribute__ ((weak)) void USB0_IRQHandler           (void) { USB0_DriverIRQHandler();           }
__attribute__ ((weak)) void RTC_IRQHandler            (void) { RTC_DriverIRQHandler();            }
__attribute__ ((weak)) void Reserved46_IRQHandler     (void) { Reserved46_DriverIRQHandler();     }
__attribute__ ((weak)) void Reserved47_IRQHandler     (void) { Reserved47_DriverIRQHandler();     }
__attribute__ ((weak)) void PIN_INT4_IRQHandler       (void) { PIN_INT4_DriverIRQHandler();       }
__attribute__ ((weak)) void PIN_INT5_IRQHandler       (void) { PIN_INT5_DriverIRQHandler();       }
__attribute__ ((weak)) void PIN_INT6_IRQHandler       (void) { PIN_INT6_DriverIRQHandler();       }
__attribute__ ((weak)) void PIN_INT7_IRQHandler       (void) { PIN_INT7_DriverIRQHandler();       }
__attribute__ ((weak)) void CTIMER2_IRQHandler        (void) { CTIMER2_DriverIRQHandler();        }
__attribute__ ((weak)) void CTIMER4_IRQHandler        (void) { CTIMER4_DriverIRQHandler();        }
__attribute__ ((weak)) void RIT_IRQHandler            (void) { RIT_DriverIRQHandler();            }
__attribute__ ((weak)) void SPIFI0_IRQHandler         (void) { SPIFI0_DriverIRQHandler();         }
__attribute__ ((weak)) void FLEXCOMM8_IRQHandler      (void) { FLEXCOMM8_DriverIRQHandler();      }
__attribute__ ((weak)) void FLEXCOMM9_IRQHandler      (void) { FLEXCOMM9_DriverIRQHandler();      }
__attribute__ ((weak)) void SDIO_IRQHandler           (void) { SDIO_DriverIRQHandler();           }
__attribute__ ((weak)) void CAN0_IRQ0_IRQHandler      (void) { CAN0_IRQ0_DriverIRQHandler();      }
__attribute__ ((weak)) void CAN0_IRQ1_IRQHandler      (void) { CAN0_IRQ1_DriverIRQHandler();      }
__attribute__ ((weak)) void CAN1_IRQ0_IRQHandler      (void) { CAN1_IRQ0_DriverIRQHandler();      }
__attribute__ ((weak)) void CAN1_IRQ1_IRQHandler      (void) { CAN1_IRQ1_DriverIRQHandler();      }
__attribute__ ((weak)) void USB1_IRQHandler           (void) { USB1_DriverIRQHandler();           }
__attribute__ ((weak)) void USB1_NEEDCLK_IRQHandler   (void) { USB1_NEEDCLK_DriverIRQHandler();   }
__attribute__ ((weak)) void ETHERNET_IRQHandler       (void) { ETHERNET_DriverIRQHandler();       }
__attribute__ ((weak)) void ETHERNET_PMT_IRQHandler   (void) { ETHERNET_PMT_DriverIRQHandler();   }
__attribute__ ((weak)) void ETHERNET_MACLP_IRQHandler (void) { ETHERNET_MACLP_DriverIRQHandler(); }
__attribute__ ((weak)) void EEPROM_IRQHandler         (void) { EEPROM_DriverIRQHandler();         }
__attribute__ ((weak)) void LCD_IRQHandler            (void) { LCD_DriverIRQHandler();            }
__attribute__ ((weak)) void SHA_IRQHandler            (void) { SHA_DriverIRQHandler();            }
__attribute__ ((weak)) void SMARTCARD0_IRQHandler     (void) { SMARTCARD0_DriverIRQHandler();     }
__attribute__ ((weak)) void SMARTCARD1_IRQHandler     (void) { SMARTCARD1_DriverIRQHandler();     }

/*----------------------------------------------------------------------------
  Exception / Interrupt Vector table
 *----------------------------------------------------------------------------*/
const pFunc __Vectors[] __attribute__ ((section(".vectors"))) = {
  /* Cortex-M4 Exceptions Handler */
  (pFunc)&__StackTop,           /*      Initial Stack Pointer     */
  Reset_Handler,                /*      Reset Handler             */
  NMI_Handler,                  /*      NMI Handler               */
  HardFault_Handler,            /*      Hard Fault Handler        */
  MemManage_Handler,            /*      MPU Fault Handler         */
  BusFault_Handler,             /*      Bus Fault Handler         */
  UsageFault_Handler,           /*      Usage Fault Handler       */
  0,                            /*      Reserved                  */
  0,                            /*      Reserved                  */
  0,                            /*      Reserved                  */
  0,                            /*      Reserved                  */
  SVC_Handler,                  /*      SVCall Handler            */
  DebugMon_Handler,             /*      Debug Monitor Handler     */
  0,                            /*      Reserved                  */
  PendSV_Handler,               /*      PendSV Handler            */
  SysTick_Handler,              /*      SysTick Handler           */

