Goodjamp/HIDVideoStream/sdk/devices/LPC54608/mcuxpresso/startup_LPC54608.c
  /* External interrupts */
  WDT_BOD_IRQHandler,           /* Windowed watchdog timer, Brownout detect */
  DMA0_IRQHandler,              /* DMA controller */
  GINT0_IRQHandler,             /* GPIO group 0 */
  GINT1_IRQHandler,             /* GPIO group 1 */
  PIN_INT0_IRQHandler,          /* Pin interrupt 0 or pattern match engine slice 0 */
  PIN_INT1_IRQHandler,          /* Pin interrupt 1or pattern match engine slice 1 */
  PIN_INT2_IRQHandler,          /* Pin interrupt 2 or pattern match engine slice 2 */
  PIN_INT3_IRQHandler,          /* Pin interrupt 3 or pattern match engine slice 3 */
  UTICK0_IRQHandler,            /* Micro-tick Timer */
  MRT0_IRQHandler,              /* Multi-rate timer */
  CTIMER0_IRQHandler,           /* Standard counter/timer CTIMER0 */
  CTIMER1_IRQHandler,           /* Standard counter/timer CTIMER1 */
  SCT0_IRQHandler,              /* SCTimer/PWM */
  CTIMER3_IRQHandler,           /* Standard counter/timer CTIMER3 */
  FLEXCOMM0_IRQHandler,         /* Flexcomm Interface 0 (USART, SPI, I2C, FLEXCOMM) */
  FLEXCOMM1_IRQHandler,         /* Flexcomm Interface 1 (USART, SPI, I2C, FLEXCOMM) */
  FLEXCOMM2_IRQHandler,         /* Flexcomm Interface 2 (USART, SPI, I2C, FLEXCOMM) */
  FLEXCOMM3_IRQHandler,         /* Flexcomm Interface 3 (USART, SPI, I2C, FLEXCOMM) */
  FLEXCOMM4_IRQHandler,         /* Flexcomm Interface 4 (USART, SPI, I2C, FLEXCOMM) */
  FLEXCOMM5_IRQHandler,         /* Flexcomm Interface 5 (USART, SPI, I2C,, FLEXCOMM) */
  FLEXCOMM6_IRQHandler,         /* Flexcomm Interface 6 (USART, SPI, I2C, I2S,, FLEXCOMM) */
  FLEXCOMM7_IRQHandler,         /* Flexcomm Interface 7 (USART, SPI, I2C, I2S,, FLEXCOMM) */
  ADC0_SEQA_IRQHandler,         /* ADC0 sequence A completion. */
  ADC0_SEQB_IRQHandler,         /* ADC0 sequence B completion. */
  ADC0_THCMP_IRQHandler,        /* ADC0 threshold compare and error. */
  DMIC0_IRQHandler,             /* Digital microphone and DMIC subsystem */
  HWVAD0_IRQHandler,            /* Hardware Voice Activity Detector */
  USB0_NEEDCLK_IRQHandler,      /* USB Activity Wake-up Interrupt */
  USB0_IRQHandler,              /* USB device */
  RTC_IRQHandler,               /* RTC alarm and wake-up interrupts */
  Reserved46_IRQHandler,        /* Reserved interrupt */
  Reserved47_IRQHandler,        /* Reserved interrupt */
  PIN_INT4_IRQHandler,          /* Pin interrupt 4 or pattern match engine slice 4 int */
  PIN_INT5_IRQHandler,          /* Pin interrupt 5 or pattern match engine slice 5 int */
  PIN_INT6_IRQHandler,          /* Pin interrupt 6 or pattern match engine slice 6 int */
  PIN_INT7_IRQHandler,          /* Pin interrupt 7 or pattern match engine slice 7 int */
  CTIMER2_IRQHandler,           /* Standard counter/timer CTIMER2 */
  CTIMER4_IRQHandler,           /* Standard counter/timer CTIMER4 */
  RIT_IRQHandler,               /* Repetitive Interrupt Timer */
  SPIFI0_IRQHandler,            /* SPI flash interface */
  FLEXCOMM8_IRQHandler,         /* Flexcomm Interface 8 (USART, SPI, I2C, FLEXCOMM) */
  FLEXCOMM9_IRQHandler,         /* Flexcomm Interface 9 (USART, SPI, I2C, FLEXCOMM) */
  SDIO_IRQHandler,              /* SD/MMC */
  CAN0_IRQ0_IRQHandler,         /* CAN0 interrupt0 */
  CAN0_IRQ1_IRQHandler,         /* CAN0 interrupt1 */
  CAN1_IRQ0_IRQHandler,         /* CAN1 interrupt0 */
  CAN1_IRQ1_IRQHandler,         /* CAN1 interrupt1 */
  USB1_IRQHandler,              /* USB1 interrupt */
  USB1_NEEDCLK_IRQHandler,      /* USB1 activity */
  ETHERNET_IRQHandler,          /* Ethernet */
  ETHERNET_PMT_IRQHandler,      /* Ethernet power management interrupt */
  ETHERNET_MACLP_IRQHandler,    /* Ethernet MAC interrupt */
  EEPROM_IRQHandler,            /* EEPROM interrupt */
  LCD_IRQHandler,               /* LCD interrupt */
  SHA_IRQHandler,               /* SHA interrupt */
  SMARTCARD0_IRQHandler,        /* Smart card 0 interrupt */
  SMARTCARD1_IRQHandler,        /* Smart card 1 interrupt */
};


/*----------------------------------------------------------------------------
  Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
   void Reset_Handler(void) {
  uint32_t *pSrc, *pDest;
  uint32_t *pTable __attribute__((unused));

  __disable_irq();

  /* Enable SRAM clock used by Stack */
  SYSCON->AHBCLKCTRLSET[0] = SYSCON_AHBCLKCTRL_SRAM1_MASK | SYSCON_AHBCLKCTRL_SRAM2_MASK | SYSCON_AHBCLKCTRL_SRAM3_MASK;

/*  Firstly it copies data from read only memory to RAM. There are two schemes
 *  to copy. One can copy more than one sections. Another can only copy
 *  one section.  The former scheme needs more instructions and read-only
 *  data to implement than the latter.
 *  Macro __STARTUP_COPY_MULTIPLE is used to choose between two schemes.  */

#ifdef __STARTUP_COPY_MULTIPLE
/*  Multiple sections scheme.
 *
 *  Between symbol address __copy_table_start__ and __copy_table_end__,
 *  there are array of triplets, each of which specify:
 *    offset 0: LMA of start of a section to copy from
 *    offset 4: VMA of start of a section to copy to
 *    offset 8: size of the section to copy. Must be multiply of 4
 *
 *  All addresses must be aligned to 4 bytes boundary.
 */
  pTable = &__copy_table_start__;

  for (; pTable < &__copy_table_end__; pTable = pTable + 3) {
		pSrc  = (uint32_t*)*(pTable + 0);
		pDest = (uint32_t*)*(pTable + 1);
		for (; pDest < (uint32_t*)(*(pTable + 1) + *(pTable + 2)) ; ) {
      *pDest++ = *pSrc++;
		}
	}
#else
/*  Single section scheme.
 *
 *  The ranges of copy from/to are specified by following symbols
 *    __etext: LMA of start of the section to copy from. Usually end of text
 *    __data_start__: VMA of start of the section to copy to
 *    __data_end__: VMA of end of the section to copy to
 *
 *  All addresses must be aligned to 4 bytes boundary.
 */
  pSrc  = &__etext;
  pDest = &__data_start__;

  for ( ; pDest < &__data_end__ ; ) {
    *pDest++ = *pSrc++;
  }
#endif /*__STARTUP_COPY_MULTIPLE */

/*  This part of work usually is done in C library startup code. Otherwise,
 *  define this macro to enable it in this startup.
 *
 *  There are two schemes too. One can clear multiple BSS sections. Another
 *  can only clear one section. The former is more size expensive than the
 *  latter.
 *
 *  Define macro __STARTUP_CLEAR_BSS_MULTIPLE to choose the former.
 *  Otherwise efine macro __STARTUP_CLEAR_BSS to choose the later.
 */
#ifdef __STARTUP_CLEAR_BSS_MULTIPLE
/*  Multiple sections scheme.
 *
 *  Between symbol address __copy_table_start__ and __copy_table_end__,
 *  there are array of tuples specifying:
 *    offset 0: Start of a BSS section
 *    offset 4: Size of this BSS section. Must be multiply of 4
 */
  pTable = &__zero_table_start__;

  for (; pTable < &__zero_table_end__; pTable = pTable + 2) {
		pDest = (uint32_t*)*(pTable + 0);
		for (; pDest < (uint32_t*)(*(pTable + 0) + *(pTable + 1)) ; ) {
      *pDest++ = 0;
		}
	}
#elif defined (__STARTUP_CLEAR_BSS)
/*  Single BSS section scheme.
 *
 *  The BSS section is specified by following symbols
 *    __bss_start__: start of the BSS section.
 *    __bss_end__: end of the BSS section.
 *
 *  Both addresses must be aligned to 4 bytes boundary.
 */
  pDest = &__bss_start__;

  for ( ; pDest < &__bss_end__ ; ) {
    *pDest++ = 0ul;
  }
#endif /* __STARTUP_CLEAR_BSS_MULTIPLE || __STARTUP_CLEAR_BSS */

#ifndef __NO_SYSTEM_INIT
	SystemInit();
#endif

  __enable_irq();

#ifndef __START
#define __START _start
#endif
	extern int main(void);
	main();

}


/*----------------------------------------------------------------------------
  Default Handler for Exceptions / Interrupts
 *----------------------------------------------------------------------------*/
void Default_Handler(void) {
    uint32_t ulCurrentInterrupt;

    /* Obtain the number of the currently executing interrupt. */
    __asm volatile( "mrs %0, ipsr" : "=r"( ulCurrentInterrupt ) );
	while(1);
}
